In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[1.4,np.nan],
                   [7.1,-4.5],
                  [np.nan,np.nan],
                  [0.76,1.3]],
                 index = ['a','b','c','d'],columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.76  1.3

In [4]:
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d    2.06
dtype: float64

In [5]:
df.idxmax()#最大值的索引

one    b
two    d
dtype: object

In [6]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.26 -3.2

In [8]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.086667 -1.600000
std    3.490349  4.101219
min    0.760000 -4.500000
25%    1.080000 -3.050000
50%    1.400000 -1.600000
75%    4.250000 -0.150000
max    7.100000  1.300000

In [9]:
s1 = pd.Series(['a','b','c']*4)
s1

0     a
1     b
2     c
3     a
4     b
5     c
6     a
7     b
8     c
9     a
10    b
11    c
dtype: object

In [11]:
s1.describe()

count     12
unique     3
top        c
freq       4
dtype: object